; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v1 - type_1)
 	      (pred_2 ?v3 - object ?v1 - type_1)
	      (pred_1 ?v6 - type_2 ?v7 - type_3)
	      (pred_3 ?v6 - type_2 ?v3 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v6 - type_2 ?v2 ?v4 - type_1)
       :precondition (and  (pred_4 ?v6 ?v2))
       :effect (and  (pred_4 ?v6 ?v4)
		     (not (pred_4 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v5) (pred_4 ?v6 ?v5) (pred_1 ?v6 ?v7))
       :effect (and (pred_3 ?v6 ?v8 ?v7)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_1 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v8 ?v7) (pred_4 ?v6 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_1 ?v6 ?v7)
		    (not (pred_3 ?v6 ?v8 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_07 - type_2
obj_06 obj_09 obj_14 obj_11 - type_3
obj_03 obj_05 obj_13 obj_10 - type_1
obj_02 obj_01 obj_08 obj_12 - object)
(:init
(pred_4 obj_04 obj_03)
(pred_1 obj_04 obj_06)
(pred_1 obj_04 obj_09)
(pred_4 obj_07 obj_03)
(pred_1 obj_07 obj_14)
(pred_1 obj_07 obj_11)
(pred_2 obj_02 obj_13)
(pred_2 obj_01 obj_03)
(pred_2 obj_08 obj_13)
(pred_2 obj_12 obj_05)
)
(:goal
(and
(pred_2 obj_02 obj_13)
(pred_2 obj_01 obj_03)
(pred_2 obj_08 obj_05)
(pred_2 obj_12 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_04 obj_13)))
)
)

; plan
1. (op_1 obj_04 obj_03 obj_05)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_05)
   goals met: 2 of 4
2. (op_1 obj_07 obj_03 obj_05)
   deleted: (pred_4 obj_07 obj_03)
   added: (pred_4 obj_07 obj_05)
   goals met: 2 of 4
3. (op_1 obj_04 obj_05 obj_10)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_10)
   goals met: 2 of 4
4. (op_3 obj_07 obj_12 obj_05 obj_11)
   deleted: (pred_2 obj_12 obj_05) (pred_1 obj_07 obj_11)
   added: (pred_3 obj_07 obj_12 obj_11)
   goals met: 2 of 4
5. (op_1 obj_07 obj_05 obj_13)
   deleted: (pred_4 obj_07 obj_05)
   added: (pred_4 obj_07 obj_13)
   goals met: 2 of 4
6. (op_2 obj_07 obj_12 obj_13 obj_11)
   deleted: (pred_3 obj_07 obj_12 obj_11)
   added: (pred_2 obj_12 obj_13) (pred_1 obj_07 obj_11)
   goals met: 3 of 4
7. (op_3 obj_07 obj_08 obj_13 obj_14)
   deleted: (pred_2 obj_08 obj_13) (pred_1 obj_07 obj_14)
   added: (pred_3 obj_07 obj_08 obj_14)
   goals met: 3 of 4
8. (op_1 obj_07 obj_13 obj_05)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_05)
   goals met: 3 of 4
9. (op_2 obj_07 obj_08 obj_05 obj_14)
   deleted: (pred_3 obj_07 obj_08 obj_14)
   added: (pred_2 obj_08 obj_05) (pred_1 obj_07 obj_14)
   goals met: 4 of 4
